; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	infrared1 - mode
	image0 - mode
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 176)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 187)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 199)
	(supports instrument4 image0)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 164)
	(= (data Phenomenon5 image2) 146)
	(= (data Phenomenon6 image2) 200)
	(= (data Phenomenon7 image2) 252)
	(= (data Star8 image2) 293)
	(= (data Star9 image2) 117)
	(= (data Star10 image2) 16)
	(= (data Phenomenon11 image2) 172)
	(= (data Phenomenon5 infrared1) 256)
	(= (data Phenomenon6 infrared1) 152)
	(= (data Phenomenon7 infrared1) 234)
	(= (data Star8 infrared1) 196)
	(= (data Star9 infrared1) 178)
	(= (data Star10 infrared1) 174)
	(= (data Phenomenon11 infrared1) 155)
	(= (data Phenomenon5 image0) 264)
	(= (data Phenomenon6 image0) 110)
	(= (data Phenomenon7 image0) 154)
	(= (data Star8 image0) 208)
	(= (data Star9 image0) 244)
	(= (data Star10 image0) 201)
	(= (data Phenomenon11 image0) 124)
	(= (slew_time Star1 GroundStation0) 83.04)
	(= (slew_time GroundStation0 Star1) 83.04)
	(= (slew_time Star3 GroundStation0) 53.37)
	(= (slew_time GroundStation0 Star3) 53.37)
	(= (slew_time Star3 Star1) 62.59)
	(= (slew_time Star1 Star3) 62.59)
	(= (slew_time Star3 GroundStation2) 45.09)
	(= (slew_time GroundStation2 Star3) 45.09)
	(= (slew_time GroundStation4 GroundStation0) 85.49)
	(= (slew_time GroundStation0 GroundStation4) 85.49)
	(= (slew_time GroundStation4 Star1) 36.7)
	(= (slew_time Star1 GroundStation4) 36.7)
	(= (slew_time GroundStation4 GroundStation2) 58.07)
	(= (slew_time GroundStation2 GroundStation4) 58.07)
	(= (slew_time GroundStation4 Star3) 39.72)
	(= (slew_time Star3 GroundStation4) 39.72)
	(= (slew_time GroundStation2 GroundStation0) 44.78)
	(= (slew_time GroundStation0 GroundStation2) 44.78)
	(= (slew_time GroundStation2 Star1) 26.28)
	(= (slew_time Star1 GroundStation2) 26.28)
	(= (slew_time Phenomenon5 GroundStation0) 0.07427)
	(= (slew_time GroundStation0 Phenomenon5) 0.07427)
	(= (slew_time Phenomenon5 Star1) 60.82)
	(= (slew_time Star1 Phenomenon5) 60.82)
	(= (slew_time Phenomenon5 GroundStation2) 24.99)
	(= (slew_time GroundStation2 Phenomenon5) 24.99)
	(= (slew_time Phenomenon5 Star3) 24.59)
	(= (slew_time Star3 Phenomenon5) 24.59)
	(= (slew_time Phenomenon5 GroundStation4) 17.18)
	(= (slew_time GroundStation4 Phenomenon5) 17.18)
	(= (slew_time Phenomenon6 GroundStation0) 40.19)
	(= (slew_time GroundStation0 Phenomenon6) 40.19)
	(= (slew_time Phenomenon6 Star1) 3.758)
	(= (slew_time Star1 Phenomenon6) 3.758)
	(= (slew_time Phenomenon6 GroundStation2) 67.94)
	(= (slew_time GroundStation2 Phenomenon6) 67.94)
	(= (slew_time Phenomenon6 Star3) 1.931)
	(= (slew_time Star3 Phenomenon6) 1.931)
	(= (slew_time Phenomenon6 GroundStation4) 8.981)
	(= (slew_time GroundStation4 Phenomenon6) 8.981)
	(= (slew_time Phenomenon6 Phenomenon5) 31.56)
	(= (slew_time Phenomenon5 Phenomenon6) 31.56)
	(= (slew_time Phenomenon7 GroundStation0) 21.6)
	(= (slew_time GroundStation0 Phenomenon7) 21.6)
	(= (slew_time Phenomenon7 Star1) 83.94)
	(= (slew_time Star1 Phenomenon7) 83.94)
	(= (slew_time Phenomenon7 GroundStation2) 30.91)
	(= (slew_time GroundStation2 Phenomenon7) 30.91)
	(= (slew_time Phenomenon7 Star3) 13.28)
	(= (slew_time Star3 Phenomenon7) 13.28)
	(= (slew_time Phenomenon7 GroundStation4) 26.83)
	(= (slew_time GroundStation4 Phenomenon7) 26.83)
	(= (slew_time Phenomenon7 Phenomenon5) 11.07)
	(= (slew_time Phenomenon5 Phenomenon7) 11.07)
	(= (slew_time Phenomenon7 Phenomenon6) 29.7)
	(= (slew_time Phenomenon6 Phenomenon7) 29.7)
	(= (slew_time Star8 GroundStation0) 29.38)
	(= (slew_time GroundStation0 Star8) 29.38)
	(= (slew_time Star8 Star1) 19.46)
	(= (slew_time Star1 Star8) 19.46)
	(= (slew_time Star8 GroundStation2) 50.64)
	(= (slew_time GroundStation2 Star8) 50.64)
	(= (slew_time Star8 Star3) 63.25)
	(= (slew_time Star3 Star8) 63.25)
	(= (slew_time Star8 GroundStation4) 33.89)
	(= (slew_time GroundStation4 Star8) 33.89)
	(= (slew_time Star8 Phenomenon5) 41.87)
	(= (slew_time Phenomenon5 Star8) 41.87)
	(= (slew_time Star8 Phenomenon6) 39.14)
	(= (slew_time Phenomenon6 Star8) 39.14)
	(= (slew_time Star8 Phenomenon7) 37.45)
	(= (slew_time Phenomenon7 Star8) 37.45)
	(= (slew_time Star9 GroundStation0) 25.23)
	(= (slew_time GroundStation0 Star9) 25.23)
	(= (slew_time Star9 Star1) 56.34)
	(= (slew_time Star1 Star9) 56.34)
	(= (slew_time Star9 GroundStation2) 9.357)
	(= (slew_time GroundStation2 Star9) 9.357)
	(= (slew_time Star9 Star3) 8.596)
	(= (slew_time Star3 Star9) 8.596)
	(= (slew_time Star9 GroundStation4) 53.72)
	(= (slew_time GroundStation4 Star9) 53.72)
	(= (slew_time Star9 Phenomenon5) 17.54)
	(= (slew_time Phenomenon5 Star9) 17.54)
	(= (slew_time Star9 Phenomenon6) 15.2)
	(= (slew_time Phenomenon6 Star9) 15.2)
	(= (slew_time Star9 Phenomenon7) 55.82)
	(= (slew_time Phenomenon7 Star9) 55.82)
	(= (slew_time Star9 Star8) 66.06)
	(= (slew_time Star8 Star9) 66.06)
	(= (slew_time Star10 GroundStation0) 36.94)
	(= (slew_time GroundStation0 Star10) 36.94)
	(= (slew_time Star10 Star1) 30.08)
	(= (slew_time Star1 Star10) 30.08)
	(= (slew_time Star10 GroundStation2) 31.68)
	(= (slew_time GroundStation2 Star10) 31.68)
	(= (slew_time Star10 Star3) 34.03)
	(= (slew_time Star3 Star10) 34.03)
	(= (slew_time Star10 GroundStation4) 42.22)
	(= (slew_time GroundStation4 Star10) 42.22)
	(= (slew_time Star10 Phenomenon5) 10.66)
	(= (slew_time Phenomenon5 Star10) 10.66)
	(= (slew_time Star10 Phenomenon6) 10.84)
	(= (slew_time Phenomenon6 Star10) 10.84)
	(= (slew_time Star10 Phenomenon7) 5.41)
	(= (slew_time Phenomenon7 Star10) 5.41)
	(= (slew_time Star10 Star8) 4.957)
	(= (slew_time Star8 Star10) 4.957)
	(= (slew_time Star10 Star9) 8.12)
	(= (slew_time Star9 Star10) 8.12)
	(= (slew_time Phenomenon11 GroundStation0) 50.92)
	(= (slew_time GroundStation0 Phenomenon11) 50.92)
	(= (slew_time Phenomenon11 Star1) 35.47)
	(= (slew_time Star1 Phenomenon11) 35.47)
	(= (slew_time Phenomenon11 GroundStation2) 11.82)
	(= (slew_time GroundStation2 Phenomenon11) 11.82)
	(= (slew_time Phenomenon11 Star3) 72.3)
	(= (slew_time Star3 Phenomenon11) 72.3)
	(= (slew_time Phenomenon11 GroundStation4) 31.04)
	(= (slew_time GroundStation4 Phenomenon11) 31.04)
	(= (slew_time Phenomenon11 Phenomenon5) 18.53)
	(= (slew_time Phenomenon5 Phenomenon11) 18.53)
	(= (slew_time Phenomenon11 Phenomenon6) 13.09)
	(= (slew_time Phenomenon6 Phenomenon11) 13.09)
	(= (slew_time Phenomenon11 Phenomenon7) 61.73)
	(= (slew_time Phenomenon7 Phenomenon11) 61.73)
	(= (slew_time Phenomenon11 Star8) 11.75)
	(= (slew_time Star8 Phenomenon11) 11.75)
	(= (slew_time Phenomenon11 Star9) 22.38)
	(= (slew_time Star9 Phenomenon11) 22.38)
	(= (slew_time Phenomenon11 Star10) 69.36)
	(= (slew_time Star10 Phenomenon11) 69.36)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite3 GroundStation0)
	(have_image Phenomenon6 image2)
	(have_image Phenomenon7 image0)
	(have_image Star8 infrared1)
	(have_image Star9 image2)
	(have_image Star10 image0)
	(have_image Phenomenon11 image0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 star8 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 199 to 169.62, (fuel-used) from 0 to 29.38
   goals met: 0 of 8
2. (turn_to satellite3 groundstation0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation0)
   changed: (fuel satellite3) from 164 to 78.51, (fuel-used) from 29.38 to 114.87
   goals met: 1 of 8
3. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 176 to 171.043, (fuel-used) from 114.87 to 119.827
   goals met: 1 of 8
4. (turn_to satellite2 phenomenon11 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon11)
   changed: (fuel satellite2) from 169.62 to 157.87, (fuel-used) from 119.827 to 131.577
   goals met: 1 of 8
5. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 171.043 to 162.923, (fuel-used) from 131.577 to 139.697
   goals met: 1 of 8
6. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 8
7. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 162.923 to 154.803, (fuel-used) from 139.697 to 147.817
   goals met: 1 of 8
8. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 154.803 to 146.683, (fuel-used) from 147.817 to 155.937
   goals met: 1 of 8
9. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 146.683 to 138.563, (fuel-used) from 155.937 to 164.057
   goals met: 1 of 8
10. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 138.563 to 130.443, (fuel-used) from 164.057 to 172.177
   goals met: 1 of 8
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
12. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 130.443 to 122.323, (fuel-used) from 172.177 to 180.297
   goals met: 1 of 8
13. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 122.323 to 114.203, (fuel-used) from 180.297 to 188.417
   goals met: 1 of 8
14. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 114.203 to 106.083, (fuel-used) from 188.417 to 196.537
   goals met: 1 of 8
15. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 106.083 to 97.963, (fuel-used) from 196.537 to 204.657
   goals met: 1 of 8
16. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 97.963 to 89.843, (fuel-used) from 204.657 to 212.777
   goals met: 1 of 8
17. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 89.843 to 81.723, (fuel-used) from 212.777 to 220.897
   goals met: 1 of 8
18. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 81.723 to 73.603, (fuel-used) from 220.897 to 229.017
   goals met: 1 of 8
19. (turn_to satellite2 star3 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 157.87 to 85.57, (fuel-used) from 229.017 to 301.317
   goals met: 1 of 8
20. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 8
21. (turn_to satellite2 phenomenon11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon11)
   changed: (fuel satellite2) from 85.57 to 13.27, (fuel-used) from 301.317 to 373.617
   goals met: 1 of 8
22. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 73.603 to 65.483, (fuel-used) from 373.617 to 381.737
   goals met: 1 of 8
23. (take_image satellite2 phenomenon11 instrument3 image0)
   added: (have_image phenomenon11 image0)
   changed: (data_capacity satellite2) from 1000 to 876, (data-stored) from 0 to 124
   goals met: 2 of 8
24. (turn_to satellite2 star8 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 13.27 to 1.52, (fuel-used) from 381.737 to 393.487
   goals met: 2 of 8
25. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 65.483 to 56.887, (fuel-used) from 393.487 to 402.083
   goals met: 2 of 8
26. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 8
27. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 56.887 to 48.291, (fuel-used) from 402.083 to 410.679
   goals met: 2 of 8
28. (take_image satellite0 star9 instrument0 image2)
   added: (have_image star9 image2)
   changed: (data_capacity satellite0) from 1000 to 883, (data-stored) from 124 to 241
   goals met: 3 of 8
29. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 48.291 to 40.171, (fuel-used) from 410.679 to 418.799
   goals met: 3 of 8
30. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   changed: (data_capacity satellite0) from 883 to 682, (data-stored) from 241 to 442
   goals met: 4 of 8
31. (turn_to satellite0 phenomenon6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 40.171 to 29.331, (fuel-used) from 418.799 to 429.639
   goals met: 4 of 8
32. (take_image satellite0 phenomenon6 instrument0 image2)
   added: (have_image phenomenon6 image2)
   changed: (data_capacity satellite0) from 682 to 482, (data-stored) from 442 to 642
   goals met: 5 of 8
33. (turn_to satellite0 star3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 29.331 to 27.4, (fuel-used) from 429.639 to 431.57
   goals met: 5 of 8
34. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 27.4 to 14.12, (fuel-used) from 431.57 to 444.85
   goals met: 6 of 8
35. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   changed: (data_capacity satellite0) from 482 to 328, (data-stored) from 642 to 796
   goals met: 7 of 8
36. (take_image satellite2 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   changed: (data_capacity satellite2) from 876 to 680, (data-stored) from 796 to 992
   goals met: 8 of 8
